# Pandas

In [1]:
# pandas is a library of Python
# Why?
# Pandas is a python library used to work with data sets
# It has functions for analyzing, cleaning, Exploring and manipulating the data
# Pandas is developed by wes mckinney in 2008
# Pandas is mostly used for EDA (Exploratory Data Analysis)

In [3]:
# To install pandas library
!pip install pandas

Unable to create process using 'C:\Users\Syed Rahman Hussain\AppData\Local\anaconda3\python.exe "C:\Users\Syed Rahman Hussain\AppData\Local\anaconda3\Scripts\pip-script.py" install pandas'

In [4]:
# to use pandas library
import pandas as pd # pd is the standard name of pandas

In [5]:
#  to check the version of library
print(pd.__version__)

1.5.3

In [6]:
# One Dim in pandas is called Series
# Two Dim in pandas is called DataFrame

In [7]:
# Names list
names = ["Rahman",'Adnan','Junaid','Siddique','Jaber','Sultan']

In [8]:
for i in names:
    print(i.upper())

RAHMAN
ADNAN
JUNAID
SIDDIQUE
JABER
SULTAN

In [9]:
age = [23,22,20,25,22,25]

In [10]:
total = 0
for i in age:
    total += i
    average = total/len(age)
print(average)

22.833333333333332

In [11]:
type(names)

list

In [13]:
# converting list into pandas series
sr = pd.Series(names)
sr

0      Rahman
1       Adnan
2      Junaid
3    Siddique
4       Jaber
5      Sultan
dtype: object

In [16]:
type(sr)

pandas.core.series.Series

In [17]:
student_details = {
    "ID":[1,2,3,4,5],
    "Name":["Rahman",'Adnan','Junaid','Siddique','Jaber'],
    "Age":[24,22,22,25,21]
}

In [18]:
type(student_details)

dict

In [20]:
for i,j in student_details.items():
    print(i,j)

ID [1, 2, 3, 4, 5]
Name ['Rahman', 'Adnan', 'Junaid', 'Siddique', 'Jaber']
Age [24, 22, 22, 25, 21]

In [21]:
# converting dict into pandas DataFrame
df = pd.DataFrame(student_details)
df

   ID      Name  Age
0   1    Rahman   24
1   2     Adnan   22
2   3    Junaid   22
3   4  Siddique   25
4   5     Jaber   21

In [23]:
df['Name'].str.upper()

0      RAHMAN
1       ADNAN
2      JUNAID
3    SIDDIQUE
4       JABER
Name: Name, dtype: object

In [24]:
df['Age'].mean()

22.8

In [25]:
type(df)

pandas.core.frame.DataFrame

In [26]:
# task
# Scrapping the data from the website
# The data stored in the data structure in python
# convert data structre into dataframe
# After Preproccessing the data
# load the data into any type of file

In [28]:
# to load the data into a file
df.to_csv("Student_Details.csv",index=False)

In [29]:
# to read csv file data
df1 = pd.read_csv("Student_Details.csv")
df1

   ID      Name  Age
0   1    Rahman   24
1   2     Adnan   22
2   3    Junaid   22
3   4  Siddique   25
4   5     Jaber   21

In [32]:
!pip install pymysql

Unable to create process using 'C:\Users\Syed Rahman Hussain\AppData\Local\anaconda3\python.exe "C:\Users\Syed Rahman Hussain\AppData\Local\anaconda3\Scripts\pip-script.py" install pymysql'

In [30]:
# To create connection between python and mysql Database Application
# cerd user='root',host='localhost',port=3306,password='mysql',db='classicmodels'

import pymysql as sql

In [36]:
conn = sql.Connect(user='root',
                  host='localhost',
                  port=3306,
                  password='mysql',
                  db='healthcare')
print(conn)

<pymysql.connections.Connection object at 0x000002147ABE7DF0>

In [37]:
app_df = pd.read_sql_query("select * from appointments;",conn)
app_df

C:\Users\Syed Rahman Hussain\AppData\Local\Temp\ipykernel_9212\2247987680.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  app_df = pd.read_sql_query("select * from appointments;",conn)

    AppointmentID  PatientID  DoctorID AppointmentDate
0               1         39         6      2023-11-19
1               2         69         1      2023-10-06
2               3         93         3      2023-10-11
3               4         65         8      2023-10-30
4               5         45         7      2023-10-11
..            ...        ...       ...             ...
95             96         17         8      2023-11-03
96             97         11         8      2023-10-19
97             98         48         3      2023-11-24
98             99          4         9      2023-11-04
99            100         16         8      2023-11-29

[100 rows x 4 columns]